package ui_testcases;

/**
 * Название: Пользователь может сделать депозит
 *  Позитивный кейс:
 *   Предшаги:
 *   - админ логинится
 *   - админ создает юзера
 *   - юзер логинится
 *   - юзер открывает счет
 *   Шаги:
 *   - юзер открыл UserDashboard
 *   - юзер нажал Deposit Money
 *   - юзер переходит в окно депозита
 *   - юзер в input выбирает свой аккаунт
 *   - юзер в input вводит корректную сумму
 *   - юзер нажимает deposit
 *   Ожидания:
 *   - аллерт, что депозит прошел успешно
 *   - проверка, что баланс изменился через api
 *
 *  Негативный кейс:
 *   Предшаги:
 *   - админ логинится
 *   - админ создает юзера
 *   - юзер логинится
 *   - юзер открывает счет
 *   Шаги:
 *   - юзер открыл UserDashboard
 *   - юзер нажал Deposit Money
 *   - юзер переходит в окно депозита
 *   - юзер в input выбирает свой аккаунт
 *   - юзер в input вводит некорректную сумму
 *   - юзер нажимает deposit
 *   Ожидания:
 *   - аллерт с текстом ошибки
 *   - проверка, что баланс не изменился через api
 *
 *
 *
 *
 * Название: Пользователь может сделать трансфер
 *  Позитивный кейс:
 *   Предшаги:
 *   - админ логинится
 *   - админ создает первого юзера
 *   - админ создает второго юзера
 *   - 2 юзер логинится
 *   - 2 юзер открывает счет
 *   - 1 юзер логинится
 *   - 1 юзер открывает счет
 *   - 1 юзер делает депозит с корректной суммой
 *   Шаги:
 *   - юзер 1 открыл UserDashboard
 *   - юзер 1 нажал Make A Transfer
 *   - юзер 1 переходит в окно трансфера
 *   - юзер 1 нажимает кнопку New Transfer
 *   - юзер 1 в input выбирает свой аккаунт
 *   - юзер 1 в input вводит корректный номер счета юзера 2
 *   - юзер 1 в input вводит корректную сумму
 *   - юзер 1 ставит галочку в чекбокс
 *   - юзер 1 нажимает make a transfer
 *   Ожидания:
 *   - аллерт, что трансфер прошел успешно
 *   - проверка, что баланс 1 юзера изменился через api
 *
 *  Негативный кейс:
 *   Предшаги:
 *   - админ логинится
 *   - админ создает первого юзера
 *   - админ создает второго юзера
 *   - 2 юзер логинится
 *   - 2 юзер открывает счет
 *   - 1 юзер логинится
 *   - 1 юзер открывает счет
 *   - 1 юзер делает депозит с корректной суммой
 *   Шаги:
 *   - юзер 1 открыл UserDashboard
 *   - юзер 1 нажал Make A Transfer
 *   - юзер 1 переходит в окно трансфера
 *   - юзер 1 нажимает кнопку New Transfer
 *   - юзер 1 в input выбирает свой аккаунт
 *   - юзер 1 в input вводит корректный номер счета юзера 2
 *   - юзер 1 в input вводит некорректную сумму
 *   - юзер 1 ставит галочку в чекбокс
 *   - юзер 1 нажимает make a transfer
 *   Ожидания:
 *   - аллерт с текстом ошибки
 *   - проверка, что баланс не изменился через api
 *
 *
 * Название: Пользователь может изменить имя
 *  Позитивный кейс:
 *   Предшаги:
 *   - админ логинится
 *   - админ создает юзера
 *   - юзер логинится
 *   Шаги:
 *   - юзер открыл UserDashboard
 *   - юзер нажал кнопку Noname с @useraname
 *   - юзер переходит в окно изменения профиля
 *   - юзер в input вводит корректное имя
 *   - юзер нажимает кнопку save changes
 *   Ожидания:
 *   - аллерт, что изменение имени прошло успешно
 *   - на userDashboard появилось обновленное имя
 *   - проверка, что имя изменилось через api
 *
 *  Негативный кейс:
 *   Предшаги:
 *   - админ логинится
 *   - админ создает юзера
 *   - юзер логинится
 *   Шаги:
 *   - юзер открыл UserDashboard
 *   - юзер нажал кнопку Noname с @useraname
 *   - юзер переходит в окно изменения профиля
 *   - юзер в input вводит некорректное имя
 *   - юзер нажимает кнопку save changes
 *   Ожидания:
 *   - аллерт с текстом ошибки
 *   - проверка, что имя не изменилось через api (оно должно быть null)
 **/
 public class TestCases {

}
